/**
 Export to JSON plugin for PHPMyAdmin
 @version 4.6.6deb5ubuntu0.5
 */

// Database 'thomaskbird'

// thomaskbird.services

[{"id":"1","icon":"code","title":"Software Development","slug":"software-development","body":"<p>We build custom software solutions for every need, whether you need an ecommerce solution or an automated system to manage infrastructure we can create a custom tailored solution that meets your needs.<\/p>","created_at":"2017-03-30 19:34:42","updated_at":"2017-03-30 19:40:00","deleted_at":null}, {"id":"2","icon":"camera-retro","title":"Product Photography & Videography","slug":"product-photography-videography","body":"<p>We have staff photographers for all your needs, whether you need portraiture, product or facility photography we can take care of your needs. Our experienced photographers have years of experience creating innovative and dynamic imagery.<\/p>","created_at":"2017-03-30 19:41:21","updated_at":"2017-03-30 19:41:21","deleted_at":null}, {"id":"3","icon":"magic","title":"Design & Artwork","slug":"design-artwork","body":"<p>User experience is a major focus, we emphasize great experiences on a variety of devices like mobile, table and desktop. Our solutions put your users first ensuring higher return on investment and follow through!<\/p>","created_at":"2017-03-30 19:47:43","updated_at":"2017-03-30 19:47:43","deleted_at":null}, {"id":"4","icon":"wordpress","title":"Wordpress Development","slug":"wordpress-development","body":"<p>We create great custom themes and build custom functionality into existing Wordpress builds and ground up builds. We can quickly mock up your site and provide you an amazing site that fits your needs.<\/p>","created_at":"2017-03-30 19:48:37","updated_at":"2017-03-30 19:48:37","deleted_at":null}, {"id":"5","icon":"server","title":"Server Administration","slug":"server-administration","body":"<p>Utilization of Ubuntu webserver on Amazon Web Servers ensure that your site is always up with distributed load balancers ensuring virtually no downtime and fast secure pages.<\/p>","created_at":"2017-03-30 19:49:01","updated_at":"2017-03-30 19:49:01","deleted_at":null}, {"id":"6","icon":"camera","title":"Drone Photography & Videography","slug":"drone-photography-videography","body":"<p>Utilizing the latest technology in aerial drone photography allows us to safely capture stunning visuals that will draw attention and wow your customers. We use state of the art drones that can detect obstructions, manuever around obstructions automatically making these crafts agile, safe and smooth to operate. Giving us the capability to give you video that is at the level only most large businesses could afford.<\/p>","created_at":"2017-03-30 19:49:22","updated_at":"2017-03-30 19:49:22","deleted_at":null}]
