/**
 Export to JSON plugin for PHPMyAdmin
 @version 4.6.6deb5ubuntu0.5
 */

// Database 'thomaskbird'

// thomaskbird.skills

[{"id":"2","title":"AngularJS, Backbone & EmberJS","slug":"angularjs-backbone-emberjs","body":"Utilizing existing API’s or custom built API’s, I create intuitive and responsive web applications with Ember, BackboneJS or AngularJS. I have an extensive knowledge and experience with Angular, Ember, Handlebars and jQuery.","priority":"2","created_at":"2017-03-17 02:18:14","updated_at":"2018-05-12 02:04:20","deleted_at":null}, {"id":"5","title":"JavaScript","slug":"javascript","body":"Javascript is one of my favorite languages to write with, especially now with such a wide adoption and new advances in server side javascript makes the language a huge tool for building intuitive user experiences on every platform available.","priority":"6","created_at":"2017-03-17 02:27:53","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"6","title":"MySql","slug":"mysql","body":"Building one to one relational databases or one to many, I specialize in creating smart and organized databases that are efficient and the most optimal they can be","priority":"7","created_at":"2017-03-17 02:32:13","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"7","title":"Wordpress","slug":"wordpress","body":"I often use Wordpress for creating websites for clients, I like the CMS but in recent times I have started to favor custom built solutions because of all the security risks associated with using such popular platform","priority":"8","created_at":"2017-03-17 02:33:21","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"8","title":"Laravel","slug":"laravel","body":"As my preferred choice for building complex software systems, Laravel provides a superior framework that gets your applications up and running quickly and securely!","priority":"4","created_at":"2017-03-17 02:34:45","updated_at":"2018-05-12 02:04:20","deleted_at":null}, {"id":"9","title":"EmberJS","slug":"emberjs","body":"EmberJS is another framework that I quite often building applications although not used as much as I use AngularJS.","priority":"9","created_at":"2017-03-17 02:35:43","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"10","title":"API Development","slug":"api-development","body":"I create robust API’s utilizing pure PHP and PHP frameworks like Laravel, to create amazing responsive and well crafted API’s giving your application infinite extendability with ease.","priority":"10","created_at":"2017-03-17 03:03:39","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"11","title":"Photo editing & Manipulation","slug":"photo-editing-manipulation","body":"Transforming dull lifeless, old aged images into crisp clear images that are compelling and intriguing utilizing Photoshop and lightroom to liven images up. Have an image that needs to be wider, I can help you widen that image by extending the image drawing in larger background and even introducing new objects into the image seamlessly.","priority":"11","created_at":"2017-03-17 03:03:52","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"12","title":"Grunt, Bower, Gulp, Yeoman, Yarn, Less","slug":"grunt-bower-gulp-yeoman-yarn-less","body":"I quickly build and develop front end applications utilizing these various client side tools. Each of these tools give me powerful flexibility to automate tasks and work efficiently increasing productivity, code quality and maintainability.","priority":"12","created_at":"2017-03-17 03:04:13","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"13","title":"Marketing","slug":"marketing","body":"I’ve had the pleasure of working with some of the best marketing teams in the business, ranging from top names in the automotive industry like DriveSRT, UnitedHealth Care and many more.","priority":"13","created_at":"2017-03-17 03:04:35","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"14","title":"Adobe Illustrator","slug":"adobe-illustrator","body":"Utilizing Illustrator I create vector graphics from print materials to logos and more.","priority":"14","created_at":"2017-03-17 03:05:09","updated_at":"2018-05-09 03:56:08","deleted_at":null}, {"id":"15","title":"HTML5 & CSS3","slug":"html5-css3","body":"Well programmed css, beautifully crafted by only the finest artisans, ok crafted by myself. I create object oriented css, that allows for easy extendability and is well documented along with being well formatted so that others may follow! Using html5 I create object oriented html and css that scales easily and optimizes for extendability. Using css3 I am able to create intuitive applications that scale to device screen widths and provide flawless look and feel compared to the composition.","priority":"16","created_at":"2017-03-17 03:05:28","updated_at":"2018-05-09 03:55:59","deleted_at":null}, {"id":"16","title":"Communication","slug":"communication","body":"Having had a diverse skillset and worked in a large variety of environments, has given me key insights in how to adequately communicate with others from other realms even if it may seem like they are from another planet. Understanding advanced concepts and problems allows me to better explain and relay that information to key individuals!","priority":"15","created_at":"2017-03-17 03:06:30","updated_at":"2018-05-09 03:55:59","deleted_at":null}, {"id":"17","title":"Agile Methodology","slug":"agile-methodology","body":"Sometimes we love, sometimes we hate it, there are avid lovers and equally avid haters. I personally like the concept and believe that when implemented correctly it can be a powerful tool! In all of my freelance work that is the development practice I use, and encourage for it to be used in companies that don’t yet support it!","priority":"17","created_at":"2017-03-17 03:06:43","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"18","title":"JIRA, Trello & Basecamp","slug":"jira-trello-basecamp","body":"Having worked with a large number of companies I have had a lot of experience using various organizational tools like Jira, Basecamp and others. Organization is huge with todays hectic schedules and I have the experience using these tools to make the most of my time!","priority":"18","created_at":"2017-03-17 03:07:19","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"19","title":"Photoshop","slug":"photoshop","body":"I design with photoshop, slicing and dicing with the best. Whether its creating icons, full designs or photomanipulations Photoshop is my go to design tool. I’ve used photoshop for close to six years!","priority":"19","created_at":"2017-03-17 03:07:31","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"20","title":"Responsive Programming","slug":"responsive-programming","body":"I utilize frameworks like Twitter Bootstrap or Natural to handle responsiveness, I can also hand craft media queries as necessary","priority":"20","created_at":"2017-03-17 03:07:45","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"21","title":"Ajax & JSON","slug":"ajax-json","body":"I regularly utilize AJAX & JSON when working with various services transferring data back and forth for manipulation within views","priority":"21","created_at":"2017-03-17 03:08:02","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"22","title":"CMS Integration","slug":"cms-integration","body":"I’ve utilized a large number of frameworks and content management systems to deliver my clients content, ranging from but not limited to WordPress, Drupal, Joomla, Modx, Laravel, CakePHP, CMS Made Simple and many more less notable ones. Whether its custom themes or functionality I can handle it with ease!","priority":"22","created_at":"2017-03-17 03:08:14","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"23","title":"Design","slug":"design","body":"I utilize Photoshop, have used gimp, for editing compositions, creating artwork and designing some of the best creative imaginable. I regularly interpret client feedback and translate into a design that meets and exceeds their but also has natural flow making the hardest tasks simpler for users!\r\n","priority":"23","created_at":"2017-03-17 03:08:26","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"24","title":"Wireframing","slug":"wireframing","body":"Every house has a foundation, a blue print, web applications are no different. I utilize wireframes to give structure to open space and to give clients understanding of how elements of their site will layout","priority":"24","created_at":"2017-03-17 03:09:25","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"25","title":"Python","slug":"python","body":"Right now I’m sitting on the `B` team, just started learning this language a few months ago but I have good grasp of the concepts and syntax!","priority":"25","created_at":"2017-03-17 03:09:34","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"26","title":"IDE's","slug":"ides","body":"I started out developing with plain old Windows notepad and moved to notepad++ shortly after acquiring dreamweaver and finally sublime. Sublime text allows me the ability to easily and efficiently craft hand coded beauty. Utilizing the Emmett.io I quickly mock up prototypes and full scale applications. My personal favorites as of late are Webstorm, PHPStorm, IntelliJ & Brackets","priority":"26","created_at":"2017-03-17 03:10:20","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"27","title":"PHP","slug":"php","body":"I build everything from custom content management systems to integrating custom CMS implementations and more. I love PHP and can’t get enough","priority":"27","created_at":"2017-03-17 03:12:00","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"28","title":"jQuery","slug":"jquery","body":"I’m a 10! ha, but I am pretty good with jQuery, I have a deep understanding of it and have developed a number of plugins which I have released with an open source license for others to use, because after all sharing is caring!","priority":"28","created_at":"2017-03-17 03:12:44","updated_at":"2018-05-09 03:55:57","deleted_at":null}, {"id":"29","title":"Drone Photography & Videography","slug":"drone-photography-videography","body":"Just adding something like vertical with motion adds such a new perspective that is intriguing and cinematic helping gain the interest of your users. I specialize in creating drone video and photography for events and the real estate markets.","priority":"5","created_at":"2017-03-17 03:22:13","updated_at":"2018-05-12 02:04:20","deleted_at":null}, {"id":"30","title":"Adobe Lightroom","slug":"adobe-lightroom","body":"As a photographer my choice program for editing and creating awesome pieces of work is Lightroom. I like to complement Lightroom with custom presets I create and purchased to help streamline and make myself much more efficient.","priority":"29","created_at":"2017-03-17 03:23:20","updated_at":"2018-05-09 03:54:38","deleted_at":null}, {"id":"31","title":"Story boarding","slug":"story-boarding","body":"<p>Every development starts with a story, whether its taking a user from point a to point b, its important to provide mockups and process flows along with wireframes to give vision to how this will take place. I've got 4+ years experience working with tools like Invision, uxPin and Axure among others.<\/p>","priority":"30","created_at":"2017-11-03 00:41:17","updated_at":"2018-05-09 03:54:38","deleted_at":null}, {"id":"32","title":"ReactJS","slug":"reactjs","body":"<p>The new kid on the block with a whole lot of tricks. ReactJS is one of my favorite front end frameworks to work with. I've utilized the framework to build very complex user interfaces and software platforms.&nbsp;<\/p>","priority":"1","created_at":"2018-04-25 04:02:10","updated_at":"2018-05-09 03:43:35","deleted_at":null}, {"id":"33","title":"VueJS ","slug":"vuejs","body":"<p>Laravel bakes in VueJS, so naturally it felt like a easy smooth transition to build single page apps utilizing Laravel as the backend api.<\/p>","priority":"3","created_at":"2018-04-25 04:04:09","updated_at":"2018-05-12 02:04:20","deleted_at":null}, {"id":"34","title":"Nextjs","slug":"nextjs","body":"<p>One of my preferred frameworks to couple with React, its powerful serverside features and convience makes it one of my top go to frameworks for creating applications<\/p>\r\n<p>&nbsp;<\/p>","priority":null,"created_at":"2023-01-06 07:32:43","updated_at":"2023-01-06 07:32:43","deleted_at":null}, {"id":"35","title":"Typescript","slug":"typescript","body":"Developers can finally breath easier since typescript came onto the scene. I personally started using it somewhere around 6yrs ago and haven't looked back since. ","priority":"1","created_at":"2023-01-18 00:00:00","updated_at":"2023-01-18 00:00:00","deleted_at":null}]
